#include "ThreadPool.hpp"

//---------------------------------------------------------------------------------------------------------------------------
//		Конструктор пула потоков
//---------------------------------------------------------------------------------------------------------------------------
ThreadPool::ThreadPool(std::size_t threadCount)
{
	for (size_t i = 0; i < threadCount; i++)
	{
		m_workers.emplace_back(
			[this]()
			{
				worker();
			}
		);
	}
}
//---------------------------------------------------------------------------------------------------------------------------
//		Деструктор пула потоков
//---------------------------------------------------------------------------------------------------------------------------
ThreadPool::~ThreadPool()
{
	//---- Установка флага остановки и уведомление всех потоков
	{
		std::lock_guard lock(m_mutex);
		m_stop = true;
	}

	m_condition.notify_all();

	//--- Ожидание завершения всех потоков
	for (std::thread& thread : m_workers)
	{
		if (thread.joinable())
		{
			thread.join();
		}
	}
}
//---------------------------------------------------------------------------------------------------------------------------
//		Добавление задачи в пул потоков
//---------------------------------------------------------------------------------------------------------------------------
void ThreadPool::addTask(std::function<void()> task) 
{
	//--- Добавление задачи в очередь задач с блокировкой мьютекса
	{
		std::lock_guard lock(m_mutex);
		m_tasks.push(std::move(task));
	}
	//---Уведомление одного потока о наличии новой задачи
	m_condition.notify_one(); 
}
//---------------------------------------------------------------------------------------------------------------------------
//		Функция, выполняемая каждым потоком в пуле			
//---------------------------------------------------------------------------------------------------------------------------
void ThreadPool::worker() 
{
	//---Рабочий поток выполняет задачи до остановки пула
	while (true)
	{
		//---Текущая задача, которую поток заберёт из общей очереди
		std::function<void()> task;

		//---Критическая секция для безопасной работы с общей очередью задач
		{
			//---Захватываем mutex.
			//---unique_lock нужен, потому что condition_variable временно освобождает mutex во время ожидания
			std::unique_lock lock(m_mutex);

			//---Ждём, пока появится задача или будет запрошена остановка пула
			m_condition.wait(
				lock,
				[this]()
				{
					return m_stop || !m_tasks.empty();
				}
			);
			//---Если пул остановлен и выполнять больше нечего — завершаем поток
			if (m_stop && m_tasks.empty())
			{
				return;
			}

			//---Забираем первую задачу из очереди
			task = std::move(m_tasks.front());

			//---Удаляем забранную задачу из очереди
			m_tasks.pop();
		}
		
		//---Выполняем задачу уже без блокировки mutex,
		//---чтобы другие потоки могли одновременно забирать следующие задачи
		task();
	}
}